[{"url": "https://angel.co/company/konghq/jobs/761395-senior-software-engineer-kubernetes-remote", "description": "Are you ready to join the API revolution?\nYou will be part of a team that builds the Kong for Kubernetes.\nYou will be part of a team that is responsible for managing and making Kong cloud-native. This team is responsible for making and pushing kong to the bleeding edge of cloud-native and the CNCF stack.\nWhat you'll be doing:\nWork on Kong for Kubernetes, Ingress controller, and helm charts\nAdd features and maintain Kong’s integrations with Prometheus, Grafana, Helm, and other products in the CNCF space.\nDesign and build extend Kong for Cloud-Native Stack\nLeverage your deep experience working on large scale cloud-native infrastructure\nWhat you'll bring:\nBS degree in Computer Science, similar technical field of study or equivalent practical experience\nInterest or experience in Kubernetes, service mesh, L3/4/7 Proxy, API services, container technologies, and the Cloud Native Stack.\nExperience in running Kubernetes or having a thorough understanding of Kubernetes architecture\nSolid hands-on low level technical expertise, understanding distributed systems, networking and computer systems programming\nStrong sense of ownership and good communication skills\nBonus Points:\nA demonstrable track record of large scale C/C++/Go projects, familiar with gRPC, Containerization and Microservices\nHands on experience of building and maintain Kubernetes controllers or operators\nExperience in building and fostering an Open-Source community\nHands-on technical leadership experience\nExperience scoping, resourcing, managing and overcoming obstacles in software development projects", "title": "Senior Software Engineer - Kubernetes (Remote)", "salary": "$120k – $165k AngelList Est.", "specs": {"Location": ["United States", "Remote"], "Hires remotely": "Everywhere", "Job type": "Full-time", "Visa sponsorship": "Available"}}, {"url": "https://angel.co/company/konghq/jobs/675881-technical-solutions-engineer", "description": "Are you ready to join the API revolution?\nAbout the role:\nYou will have the opportunity to work with and support many new, leading-edge technologies that solve real customer challenges while being a voice for customers, community, partners and your team. You want to make our customers and partners successful while strengthening the relationship with Kong Inc. You can make a huge impact and have real ownership for the work you do.\nWhat you'll be doing:\nWorking with top developers from around the world; helping to implement the Kong API Gateway and Microservices solutions for their unique environments\nDiving deeply into complex technical puzzles and work collaboratively to understand and resolve customer issues\nBe the champion of our customers by providing real-time feedback to Kong about product performance and customer needs\nBe a driver of innovation within the support team, the company and with our customers, by looking for better ways to do the work we do, improve the tools we use and the how we raise the bar on the service we deliver to our Global 5000 customers\nWhat you bring:\nYou are curious learner, who loves to dig into technical mysteries and have the creativity to solve complex technical problems\nYou can build relationships with like-minded teammates, smart customers, and global partners\nSome of the skills that you will regularly use include:\nREST and RESTful APIs\nCoding skills- (at a minimum read and troubleshoot code)\nContainers, cluster deployment and management tools like Docker, Docker Swarm, Kubernetes and others\nYou know your way around web architectures including HTTP\nBonus Points:\nFamiliarity with DNS, Linux/Unix type systems and/or databases", "title": "Technical Solutions Engineer", "salary": "$105k – $160k AngelList Est.", "specs": {"Location": "San Francisco", "Job type": "Full-time", "Visa sponsorship": "Not Available"}}, {"url": "https://angel.co/company/konghq/jobs/435773-senior-cloud-engineer", "description": "Are you ready to join the API revolution?\nAbout the role:\nYou will be part of a team that builds the next generation Kong API Cloud Gateway based in San Francisco, CA.\nWhat you'll be doing:\nDesign, build and operate highly available, distributed Kong API Cloud Gateway\nCollaborate with a variety of teams to design architectures to enable them on the cloud\nBuild and deploy full stack applications worldwide\nLeverage your deep experience working on large scale cloud-native infrastructure\nWhat you bring:\n2 plus years of experience with cloud architectural patterns - HTTP/HTTPS, L3/4/7 Proxy, API services, Multi-tenancy software\nSolid hands-on low level technical expertise, understanding distributed systems, networking and computer systems programming\nStrong sense of ownership and good communication skills\nBS degree in Computer Science, similar technical field of study or equivalent practical experience\nBonus Points:\nSaaS cloud background with demonstrable track record of large scale C/C++/Go projects, familiar with gRPC, Containerization and Micro-services\nHands-on technical leadership experience\nExperience scoping, resourcing, managing and overcoming obstacles in software development projects", "title": "Senior Cloud Engineer", "salary": "$100k – $150k", "specs": {"Location": "San Francisco", "Job type": "Full-time", "Visa sponsorship": "Not Available"}}]